Tekla.Structures.Analysis.AnalysisFace
The AnalysisFace class contains information related to analysis faces.

Tekla.Structures.Analysis.AnalysisFace._Positions
The positions of the analysis face.

Tekla.Structures.Analysis.AnalysisFace.Positions
The positions of the analysis face.

Tekla.Structures.Analysis.AnalysisFace.Select
Selects an analysis face.

Tekla.Structures.Analysis.AnalysisFace.SelectInstance
DO NOT USE! For internal usage only!